04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/DLR_A_LTS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0.3);

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform (0 0 42.2);
    }
    inletair
    {
        type            fixedValue;
        value           uniform (0 0 0.3);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            fixedValue;
        value           uniform (0 0 0.3);
    }
    burnerwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    burnertip
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
